In [18]:
!pip install pandas matplotlib seaborn mysql-connector-python

Requirement already satisfied: pandas in ./.conda/lib/python3.11/site-packages (2.2.3)
Requirement already satisfied: matplotlib in ./.conda/lib/python3.11/site-packages (3.10.1)
Requirement already satisfied: seaborn in ./.conda/lib/python3.11/site-packages (0.13.2)
Requirement already satisfied: mysql-connector-python in ./.conda/lib/python3.11/site-packages (9.2.0)
Requirement already satisfied: numpy>=1.23.2 in ./.conda/lib/python3.11/site-packages (from pandas) (2.2.4)
Requirement already satisfied: python-dateutil>=2.8.2 in ./.conda/lib/python3.11/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in ./.conda/lib/python3.11/site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in ./.conda/lib/python3.11/site-packages (from pandas) (2025.2)
Requirement already satisfied: contourpy>=1.0.1 in ./.conda/lib/python3.11/site-packages (from matplotlib) (1.3.1)
Requirement already satisfied: cycler>=0.10 in ./.conda/lib/python3.11/site-packages (from matplotlib) (0.12.1)
Requirement already satisfied: fonttools>=4.22.0 in ./.conda/lib/python3.11/site-packages (from matplotlib) (4.57.0)
Requirement already satisfied: kiwisolver>=1.3.1 in ./.conda/lib/python3.11/site-packages (from matplotlib) (1.4.8)
Requirement already satisfied: packaging>=20.0 in ./.conda/lib/python3.11/site-packages (from matplotlib) (24.2)
Requirement already satisfied: pillow>=8 in ./.conda/lib/python3.11/site-packages (from matplotlib) (11.1.0)
Requirement already satisfied: pyparsing>=2.3.1 in ./.conda/lib/python3.11/site-packages (from matplotlib) (3.2.3)
Requirement already satisfied: six>=1.5 in ./.conda/lib/python3.11/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [19]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import mysql.connector

db = mysql.connector.connect(host = "localhost",
                             username = "root",
                             password = "M@ngo112",
                             database = "ECommerce")

cur = db.cursor()

# List all the unique cities where customers are located.

In [ ]:
query = """ SELECT DISTINCT customer_city from customers """

cur.execute(query)

data = cur.fetchall()

df = pd.DataFrame(data,columns=["Cities"])

df

                     Cities
0                    franca
1     sao bernardo do campo
2                 sao paulo
3           mogi das cruzes
4                  campinas
...                     ...
4114                 siriji
4115    natividade da serra
4116           monte bonito
4117             sao rafael
4118      eugenio de castro

[4119 rows x 1 columns]

# Count the numbers of orders placed in 2017.

In [21]:
query = """ SELECT COUNT(order_id) FROM orders WHERE year(order_purchase_timestamp) = 2017  """

cur.execute(query)

data = cur.fetchall()

"Total orders placed in 2017 are", data[0][0]

('Total orders placed in 2017 are', 45101)

# Find the total sales per category.

In [22]:
query = """ select products.product_category category, 
round(sum(payments.payment_value), 2) sales
from products join order_items
on products.product_id = order_items.product_id
join payments 
on payments.order_id = order_items.order_id
group by category
"""

cur.execute(query)

data = cur.fetchall()

df = pd.DataFrame(data, columns = ["Category", "Sales"])

df

                       Category       Sales
0                     perfumery   506738.66
1          Furniture Decoration  1430176.39
2                     telephony   486882.05
3                bed table bath  1712553.67
4                    automotive   852294.33
..                          ...         ...
69               cds music dvds     1199.43
70                   La Cuisine     2913.53
71  Fashion Children's Clothing      785.67
72                     PC Gamer     2174.43
73       insurance and services      324.51

[74 rows x 2 columns]

# Calculate the percentage of orders that were paid in installments.

In [17]:
query = """ select (sum(case when payment_installments >= 1 then 1 else 0 end))/count(*)*100 from payments """

cur.execute(query)

data = cur.fetchall()

data

[(Decimal('99.9981'),)]

# Count the number of customers from each state.

In [38]:
query = """ select customer_state, count(customer_id)
from customers group by customer_state
 """

cur.execute(query)

data = cur.fetchall()

df = pd.DataFrame(data,columns = ["State","No. of customer"])

df

   State  No. of customer
0     SP            41746
1     SC             3637
2     MG            11635
3     PR             5045
4     RJ            12852
5     RS             5466
6     PA              975
7     GO             2020
8     ES             2033
9     BA             3380
10    MA              747
11    MS              715
12    CE             1336
13    DF             2140
14    RN              485
15    PE             1652
16    MT              907
17    AM              148
18    AP               68
19    AL              413
20    RO              253
21    PB              536
22    TO              280
23    PI              495
24    AC               81
25    SE              350
26    RR               46

# Calculate the no. of orders per month in 2018.

In [32]:
query = """ select monthname(order_purchase_timestamp) months, count(order_id) order_count
from orders where year(order_purchase_timestamp) = 2018
group by months
 """

cur.execute(query)

data = cur.fetchall()

df = pd.DataFrame(data, columns=['Month', 'Order_Count'])

month_order = ['January', 'February', 'March', 'April', 'May', 'June', 
               'July', 'August', 'September', 'October']

df['Month'] = pd.Categorical(df['Month'], categories=month_order, ordered=True)

df = df.sort_values('Month').reset_index(drop=True)

df

       Month  Order_Count
0    January         7269
1   February         6728
2      March         7211
3      April         6939
4        May         6873
5       June         6167
6       July         6292
7     August         6512
8  September           16
9    October            4

# Find the average no. of products per order, grouped by customer city.

In [37]:
query = """ with count_per_order as
(select orders.order_id, orders.customer_id, count(order_items.order_id) as oc from orders join order_items
on orders.order_id = order_items.order_id
group by orders.order_id, orders.customer_id)
select customers.customer_city, round(avg(count_per_order.oc), 2) average_orders
from customers join count_per_order
on customers.customer_id = count_per_order.customer_id
group by customers.customer_city ;
 """

cur.execute(query)

data = cur.fetchall()

df = pd.DataFrame(data, columns = ["Customer City","Average products/order"])

df

             Customer City Average products/order
0                sao paulo                   1.16
1      sao jose dos campos                   1.14
2             porto alegre                   1.17
3                  indaial                   1.12
4             treze tilias                   1.27
...                    ...                    ...
4105                buriti                   3.00
4106  morro agudo de goias                   1.00
4107        santa filomena                   1.00
4108            guamiranga                   1.00
4109         padre paraiso                   1.00

[4110 rows x 2 columns]

# Calculate the percentage of total revenue contributed by each product category.

In [44]:
query = """ select upper(products.product_category) category,
round((sum(payments.payment_value)/(select sum(payment_value) from payments))*100,2) sales_percentage
from products join order_items
on products.product_id = order_items.product_id
join payments
on payments.order_id = order_items.order_id
group by category order by sales_percentage desc;
 """

cur.execute(query)

data = cur.fetchall()

df = pd.DataFrame(data)

df

                              0      1
0                BED TABLE BATH  10.70
1                 HEALTH BEAUTY  10.35
2          COMPUTER ACCESSORIES   9.90
3          FURNITURE DECORATION   8.93
4               WATCHES PRESENT   8.93
..                          ...    ...
69              HOUSE COMFORT 2   0.01
70               CDS MUSIC DVDS   0.01
71                     PC GAMER   0.01
72  FASHION CHILDREN'S CLOTHING   0.00
73       INSURANCE AND SERVICES   0.00

[74 rows x 2 columns]